---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors
source: html/3fc99836-c4d1-1ce1-b2dd-846dab8d8bfc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors Property

Curve elements which form chains connecting points shared by more than two curve elements are ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSplittingCurveChainsBetweenMultipleNeighbors { get; }
```